tutorials/incompressible/icoDyMFoam/mixerGgi/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr BiCGStab
    {
        preconditioner
        {
            type         DILU;
        }

        minIter          0;
        maxIter          1000;
        tolerance        1e-02;
        relTol           0;
    };

    p BiCGStab
    {
        preconditioner
        {
            type         DILU;
        }

        minIter          0;
        maxIter          1000;
        tolerance        1e-07;
        relTol           0.0;
    };

    pFinal BiCGStab
    {
        preconditioner
        {
            type         DILU;
        }

        minIter          0;
        maxIter          1000;
        tolerance        1e-07;
        relTol           0;
    };

    U BiCGStab
    {
        preconditioner   
        {
            type         DILU;
        }

        minIter          0;
        maxIter          1000;
        tolerance        1e-07;
        relTol           0;
    };
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
